JohannesWilde/DollHouse/Documents/boards.txt
##############################################################

unowifi.name=Arduino Uno WiFi
unowifi.vid.0=0x2A03
unowifi.pid.0=0x0057
unowifi.upload_port.0.vid=0x2A03
unowifi.upload_port.0.pid=0x0057
unowifi.upload_port.1.board=unowifi

unowifi.upload.tool=avrdude
unowifi.upload.tool.default=avrdude
unowifi.upload.tool.network=arduino_ota
unowifi.upload.protocol=arduino
unowifi.upload.maximum_size=32256
unowifi.upload.maximum_data_size=2048
unowifi.upload.speed=115200
unowifi.upload.network.endpoint_upload=/pgm/upload
unowifi.upload.network.endpoint_sync=/pgm/sync
unowifi.upload.network.sync_return=204:SYNC
unowifi.upload.network.endpoint_reset=/log/reset
unowifi.upload.network.port=80

unowifi.bootloader.tool=avrdude
unowifi.bootloader.tool.default=avrdude
unowifi.bootloader.low_fuses=0xFF
unowifi.bootloader.high_fuses=0xDE
unowifi.bootloader.extended_fuses=0x05
unowifi.bootloader.unlock_bits=0x3F
unowifi.bootloader.lock_bits=0x0F
unowifi.bootloader.file=optiboot/optiboot_atmega328.hex

unowifi.build.mcu=atmega328p
unowifi.build.f_cpu=16000000L
unowifi.build.board=AVR_UNO_WIFI_DEV_ED
unowifi.build.core=arduino
unowifi.build.variant=standard
unowifi.build.esp_ch_uart_br=19200
unowifi.build.extra_flags=-DESP_CH_UART -DESP_CH_UART_BR={build.esp_ch_uart_br}

##############################################################
################ custom addition by J.W. #####################

unoOneMhz.name=Arduino Uno (1MHz)

unoOneMhz.vid.0=0x2341
unoOneMhz.pid.0=0x0043
unoOneMhz.vid.1=0x2341
unoOneMhz.pid.1=0x0001
unoOneMhz.vid.2=0x2A03
unoOneMhz.pid.2=0x0043
unoOneMhz.vid.3=0x2341
unoOneMhz.pid.3=0x0243

unoOneMhz.upload.tool=avrdude
unoOneMhz.upload.tool.default=avrdude
unoOneMhz.upload.tool.network=arduino_ota
unoOneMhz.upload.protocol=arduino
unoOneMhz.upload.maximum_size=32256
unoOneMhz.upload.maximum_data_size=2048
unoOneMhz.upload.speed=115200

# keep the original fuses [16MHz], as to not unintendetly render the programming arduino unprogrammable [the bootloader here expects 16MHz!].
# unoOneMhz.bootloader.tool=avrdude
# unoOneMhz.bootloader.low_fuses=0x62
# unoOneMhz.bootloader.high_fuses=0xD7
# unoOneMhz.bootloader.extended_fuses=0x07
# unoOneMhz.bootloader.unlock_bits=0x3F
# unoOneMhz.bootloader.lock_bits=0x0F
# unoOneMhz.bootloader.file="no bootloader on this configuration"

unoOneMhz.build.mcu=atmega328p
unoOneMhz.build.f_cpu=1000000L
unoOneMhz.build.board=AVR_UNO
unoOneMhz.build.core=arduino
unoOneMhz.build.variant=standard


##############################################################

unoEightMhz.name=Arduino Uno (8MHz)

unoEightMhz.vid.0=0x2341
unoEightMhz.pid.0=0x0043
unoEightMhz.vid.1=0x2341
unoEightMhz.pid.1=0x0001
unoEightMhz.vid.2=0x2A03
unoEightMhz.pid.2=0x0043
unoEightMhz.vid.3=0x2341
unoEightMhz.pid.3=0x0243

unoEightMhz.upload.tool=avrdude
unoEightMhz.upload.tool.default=avrdude
unoEightMhz.upload.tool.network=arduino_ota
unoEightMhz.upload.protocol=arduino
unoEightMhz.upload.maximum_size=32256
unoEightMhz.upload.maximum_data_size=2048
unoEightMhz.upload.speed=115200

# keep the original fuses [16MHz], as to not unintendetly render the programming arduino unprogrammable [the bootloader here expects 16MHz!].
# unoEightMhz.bootloader.tool=avrdude
# unoEightMhz.bootloader.low_fuses=0xE2
# unoEightMhz.bootloader.high_fuses=0xD7
# unoEightMhz.bootloader.extended_fuses=0x07
# unoEightMhz.bootloader.unlock_bits=0x3F
# unoEightMhz.bootloader.lock_bits=0x0F
# unoEightMhz.bootloader.file="no bootloader on this configuration"

unoEightMhz.build.mcu=atmega328p
unoEightMhz.build.f_cpu=8000000L
unoEightMhz.build.board=AVR_UNO
unoEightMhz.build.core=arduino
unoEightMhz.build.variant=standard

################ custom addition by J.W. #####################
##############################################################


###########################################################################
#
# Example boards.txt from...
#
# http://www.arduino.cc/cgi-bin/yabb2/YaBB.pl?num=1236434254/94#94
# http://www.arduino.cc/cgi-bin/yabb2/YaBB.pl?num=1274754985/6#6
# http://www.arduino.cc/cgi-bin/yabb2/YaBB.pl?num=1274820597/49#49
#
###########################################################################

attiny84at16.name=ATtiny84 @ 16 MHz  (external crystal; 4.3 V BOD)

attiny84at16.upload.tool=arduino:arduinoisp

attiny84at16.upload.maximum_size=8192
attiny84at16.upload.maximum_data_size=512

# Frequency 8.0- MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms; [CKSEL=1111 SUT=11]
# Brown-out detection level at VCC=4.3 V; [BODLEVEL=100]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]

attiny84at16.bootloader.low_fuses=0xFF
attiny84at16.bootloader.high_fuses=0xD4
attiny84at16.bootloader.extended_fuses=0xFF

attiny84at16.bootloader.file=empty/empty84at16.hex
attiny84at16.bootloader.tool=arduino:avrdude

attiny84at16.build.mcu=attiny84
attiny84at16.build.f_cpu=16000000L
attiny84at16.build.core=tiny

###########################################################################

attiny84at8.name=ATtiny84 @ 8 MHz  (internal oscillator; BOD disabled)

attiny84at8.upload.tool=arduino:arduinoisp

attiny84at8.upload.maximum_size=8192
attiny84at8.upload.maximum_data_size=512

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

attiny84at8.bootloader.low_fuses=0xE2
attiny84at8.bootloader.high_fuses=0xD7
attiny84at8.bootloader.extended_fuses=0xFF

attiny84at8.bootloader.file=empty/empty84at8.hex
attiny84at8.bootloader.tool=arduino:avrdude

attiny84at8.build.mcu=attiny84
attiny84at8.build.f_cpu=8000000L
attiny84at8.build.core=tiny

###########################################################################

attiny84at1.name=ATtiny84 @ 1 MHz  (internal oscillator; BOD disabled)

attiny84at1.upload.tool=arduino:arduinoisp

